---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarHandleType
source: html/0773859c-5f30-3fb4-25b3-34c80432aaa4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleType

The various types of handles on a Rebar instance that can be joined to References

## Syntax (C#)
```csharp
public enum RebarHandleType
```